In [1]:
import pandas as pd
import os
import csv

In [2]:
file_to_load = os.path.join("Resources", "missing_grades.csv")

In [3]:
missing_grade_df = pd.read_csv(file_to_load)

In [26]:
missing_grade_df.loc[0]

Student ID                  0
student_name     Paul Bradley
gender                      M
grade                     9th
reading_score              66
math_score                 79
Name: 0, dtype: object

In [5]:
missing_grade_df.dropna()

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [6]:
missing_grade_df

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th            NaN        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0         NaN
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [7]:
missing_grade_df.fillna("85")

   Student ID       student_name gender grade reading_score math_score
0           0       Paul Bradley      M   9th            66         79
1           1       Victor Smith      M  12th            94         61
2           2    Kevin Rodriguez      M  12th            85         60
3           3  Dr. Richard Scott      M  12th            67         58
4           4         Bonnie Ray      F   9th            97         84
5           5      Bryan Miranda      M   9th            94         85
6           6      Sheena Carter      F  11th            82         80
7           7       Nicole Baker      F  12th            96         69

In [8]:
name = "Dr. Richard Scott"
print(name)

Dr. Richard Scott

In [9]:
name.split()

['Dr.', 'Richard', 'Scott']

In [10]:
len(name.split())

3

In [18]:
numbers = [5,8,13,21]

def sqr(x):
    return(x*x)


list(map(sqr, numbers))

[25, 64, 169, 441]

In [24]:
grades = [3.76, 4.56, 7.89]

for grade in grades:
    print("{: .0f}".format(grade))

 4
 5
 8

In [ ]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]